#!/usr/bin/env python
# encoding:utf-8

"""
@software: PyCharm
@file: 内置函数.py
@time: 2017/4/30 14:15
"""

# 绝对值
abs(-19)
# 所有的值都为真的话 就为真 假值： 0，None， 空字符串，空字典，空列表，空元组, False
all()   # iterable 接收一个序列
# 只要有为真的就返回真
any()   # iterable 接收一个序列
# 没理解
# ascii(8) == __repr__()

# ------------------------------------------转换------------------------------------------------
# 二进制
bin(10)
# 布尔
bool(0)
# 接收字符串或序列 返回字节数组, 如果传入字符串需要加入编码
bytearray('张三', encoding='utf-8')
# 接收字符串或序列 返回字节字符串,如果传入字符串需要加入编码
bytes('张三', encoding='utf-8')
# 数字转换为ascii码
chr(99)
# ASCII 码转换数字
ord('a')
# 十六进制
hex()
# 八进制
oct()
# --------------------------------------------*----------------------------------------------
# 幂
pow(3, 4)
# 四舍五入方法
round()

# --------------------------------------------*----------------------------------------------
# 返回 商跟余数
divmod(34, 3)
# 传入一个序列， 给序列添加序号？
enumerate(['zhang', 'zhao', 'qian', 'sun', 'li'], 1)
# 执行字符串Python语句
eval("4*8")
#
exec()

# 接收一个函数 和 序列
li = [11, 22, 33, 44]  # 都成100
map(lambda x: x+100, li)

# 过滤 接收一个函数 和 序列参数
li = [33, 55, 11, 22, 44, 66, 99, 88, 90, 77]


def fuc(x):
    if x > 50:
        return x
filter(fuc, li)

# zip 打包
x = [1, 2, 3]
y = [4, 5, 6]
zipped = zip(x, y)
print(list(zipped))    # [(1, 4), (2, 5), (3, 6)]

# ------------------------------------------------------------------------------------------
# 不能增加修改的集合
frozenset()
# 所有的全局变量
globals()
# 局部变量
locals()

# 哈希值
hash()
# ------------------------------------------------------------------------------------------
# 接收序列 返回最大值
max()
# 接收序列 返回最小值
min()
# ------------------------------------------------------------------------------------------
# 翻转
reversed()
# 排序
sorted()
# ------------------------------------------------------------------------------------------
# 检查是否可执行
callable()
# dir 返回的为key  vars 返回的为value
dir()
vars()
# --------------------------------------dey03_OOP-----------------------------------------------